Revit 2027 API
ModelCurve.IsReferenceLine Property
Indicates if this curve is a reference curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsReferenceLine { get; }
Public ReadOnly Property IsReferenceLine As Boolean
	Get
public:
property bool IsReferenceLine {
	bool get ();
}
member IsReferenceLine : bool with get
Property Value
Boolean
See Also
Reference
ModelCurve Class
Autodesk.Revit.DB Namespace